<a href="https://colab.research.google.com/github/klajosw/python/blob/master/kl_py_PandasMerge.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

<p align="left"> 
    <img src="https://raw.githubusercontent.com/klajosw/python/master/kl_mie_python_logo_250.jpg" 
         align="left" width="251" height="251">
    
</p>


<p> </p>



# Python alapok 


## Pandas file i/o merge / JOIN és adat szűrések minta

Leírás: <https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.merge.html/>

<https://klajosw.blogspot.com/>


---

In [ ]:
# Import
import pandas as pd

In [ ]:
## csv olvasás + írás
user = pd.read_csv('ugyfelcsv1.csv', header=None, nrows=5)  ## csv-ből olvasás, nincs fejlécsor, az első 5 sort
user                                                        ## megjelenítés
user.to_csv('ugyfelcsv1_kimenet.csv')                       ## csv-be mentés

In [ ]:
## xls olvasás + írás
xlsx = pd.ExcelFile('telepules.xlsx')                      ## xls-ből olvasás
df = pd.read_excel(xlsx,  'telepules')                     ## aktív munkalap kijelőlése
df                                                         ## megjelenítés
df.to_excel('telepules_kimenet.xlsx',  sheet_name='Tel')   ## xls-be mentés

In [ ]:
print('Sor, oszlop szám' ,df.shape)  ## sor és oszlopszám kiírása
print('index', df.index)
print('Oszlop nevek', df.columns)
print('ifo',df.info())
print('count',df.count())
print('cumsum', df.cumsum())
print('describe',df.describe())

Sor, oszlop szám (3176, 2)
index RangeIndex(start=0, stop=3176, step=1)
Oszlop nevek Index(['helyseg', 'lakos'], dtype='object')
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3176 entries, 0 to 3175
Data columns (total 2 columns):
helyseg    3176 non-null object
lakos      3176 non-null int64
dtypes: int64(1), object(1)
memory usage: 49.8+ KB
ifo None
count helyseg    3176
lakos      3176
dtype: int64
cumsum                                                 helyseg    lakos
0                                              Debrecen   204333
1                                       DebrecenMiskolc   367238
2                                 DebrecenMiskolcSzeged   529075
3                             DebrecenMiskolcSzegedPécs   676794
4            DebrecenMiskolcSzegedPécsBudapest 11. ker.   821393
...                                                 ...      ...
3171  DebrecenMiskolcSzegedPécsBudapest 11. ker.Győr...  9908747
3172  DebrecenMiskolcSzegedPécsBudapest 11. ker.Győr...  9908762
3173  DebrecenMiskolcSzegedPécsBudapest 11. ker.Győr...  9908776
3174  DebrecenMiskolcSzegedPécsBudapest 11. ker.Győr...  9908789
3175  DebrecenMiskolcSzegedPécsBudapest 11. ker.Győr...  9908798

[3176 rows x 2 columns]
describe                lakos
count    3176.000000
mean     3119.898615
std     11263.585339
min         9.000000
25%       345.750000
50%       837.000000
75%      1965.250000
max    204333.000000

In [ ]:
# df.rank()
df.sort_values(by='lakos') 
df[df['lakos']>10000000]
print(df[1:3])
print('-----------')
print(df.loc[4][0])
print('-----------')
print(df.iloc[2])
print('-----------')
print(df.loc[3][0])

   helyseg   lakos
1  Miskolc  162905
2   Szeged  161837
-----------
Budapest 11. ker.
-----------
helyseg    Szeged
lakos      161837
Name: 2, dtype: object
-----------
Pécs

In [ ]:
## Text állományok megnyítása (csv: ,)
user_1 = pd.read_csv("ugyfelcsv1.csv")
user_2 = pd.read_csv("ugyfelcsv2.csv")

In [ ]:
# user = pd.read_csv('ugyfelcsv11.txt', sep='\t', lineterminator='\r')  ## TAB szeperát
user = pd.read_csv('ugyfelcsv11.txt', sep=';', lineterminator='\r')  ## pontosvesszővel szeperát
user

   ugyfel_id       vnev       knev     szdatum nem
0          1     Walter  Gwendolyn  1954-07-10   M
1          2  Armstrong     Kieran  1932-02-24   M
2          3      Kline      Silas  1938-07-16   M
3          4  Gallagher      Rhoda  1972-10-28   M
4          5  Gallagher      Robin  1940-02-02   M
5          6      Frank      Blair  1977-12-19   M
6          7       Cash    Vaughan  1989-04-06   M
7          8    Shields   Charissa  1926-03-25   F
8          9      Brown       Inga  1942-04-18   F
9         10   Crawford     Glenna  1969-05-14   F

In [ ]:
# user_1.head()  # csak első négy sor megjelenítése
user_1

   ugyfel_id       vnev       knev     szdatum nem
0          1     Walter  Gwendolyn  1954-07-10   M
1          2  Armstrong     Kieran  1932-02-24   M
2          3      Kline      Silas  1938-07-16   M
3          4  Gallagher      Rhoda  1972-10-28   M
4          5  Gallagher      Robin  1940-02-02   M
5          6      Frank      Blair  1977-12-19   M
6          7       Cash    Vaughan  1989-04-06   M
7          8    Shields   Charissa  1926-03-25   F
8          9      Brown       Inga  1942-04-18   F
9         10   Crawford     Glenna  1969-05-14   F

In [ ]:
## charset beállítás utánni megnyítás
import codecs
doc = codecs.open('ugyfelcsv11.txt','rU','UTF-8') ## open for reading with "universal" type set
user_1 = pd.read_csv(doc, sep=';')
user_1

   ugyfel_id       vnev       knev     szdatum nem
0          1     Walter  Gwendolyn  1954-07-10   M
1          2  Armstrong     Kieran  1932-02-24   M
2          3      Kline      Silas  1938-07-16   M
3          4  Gallagher      Rhoda  1972-10-28   M
4          5  Gallagher      Robin  1940-02-02   M
5          6      Frank      Blair  1977-12-19   M
6          7       Cash    Vaughan  1989-04-06   M
7          8    Shields   Charissa  1926-03-25   F
8          9      Brown       Inga  1942-04-18   F
9         10   Crawford     Glenna  1969-05-14   F

In [ ]:
# user_dada.rename(columns={"ugyfel_id": "ID"}, inplace=True)  ## fejléc átnevezése, ha szükséges lenne
# user_2.head()  ## csak elsőnégy sor 
user_2

   ugyfel_id igazolvanytipus_id igazolvanyszam
0          3                  J       YLHVLF29
1          4                  J       SIDNEE06
2          5                 SZ       DUSUNF64
3          6                 UL       ENBNYK36
4          7                 UL       PFOTXW50
5          8                  J       MMRDLZ25
6          9                 SZ       SKCMWG34
7         10                 UL       VUKMBG65
8         11                 SZ       NCGJMG03
9         12                 SZ       LZQSRL48

In [ ]:
# user_id.rename(columns={"ugyfel_id": "ID"}, inplace=True)
user_id.head(10)

   ugyfel_id igazolvanytipus_id igazolvanyszam
0          1                 SZ       NCGJMG03
1          2                 SZ       LZQSRL48
2          3                  J       YLHVLF29
3          4                  J       SIDNEE06
4          5                 SZ       DUSUNF64
5          6                 UL       ENBNYK36
6          7                 UL       PFOTXW50
7          8                  J       MMRDLZ25
8          9                 SZ       SKCMWG34
9         10                 UL       VUKMBG65

---

## Két forrás tartalmának összekapcsolása 1.

Kapcsolás az `ugyfel_id` kulcs mező szerint történik

---

In [ ]:
result = pd.merge(user_1,
                 user_2[['ugyfel_id', 'igazolvanyszam']], ## hozzáfűzési mezők, az első a kulcs mező
                 on='ugyfel_id',                          ## kulcs mező a kapcsoláshoz (azonos nevüek legyenek)
                 how='left',                              ## Kapcsolat módja (left, right, outer, inner)
                 indicator=True                           ## jelző újmezőben megjelenítése                   
                 )
result.head(10)

   ugyfel_id       vnev       knev     szdatum nem igazolvanyszam     _merge
0          1     Walter  Gwendolyn  1954-07-10   M            NaN  left_only
1          2  Armstrong     Kieran  1932-02-24   M            NaN  left_only
2          3      Kline      Silas  1938-07-16   M       YLHVLF29       both
3          4  Gallagher      Rhoda  1972-10-28   M       SIDNEE06       both
4          5  Gallagher      Robin  1940-02-02   M       DUSUNF64       both
5          6      Frank      Blair  1977-12-19   M       ENBNYK36       both
6          7       Cash    Vaughan  1989-04-06   M       PFOTXW50       both
7          8    Shields   Charissa  1926-03-25   F       MMRDLZ25       both
8          9      Brown       Inga  1942-04-18   F       SKCMWG34       both
9         10   Crawford     Glenna  1969-05-14   F       VUKMBG65       both

Nézzük egy érték vizsgálatot.

In [ ]:
print("user_1 shape: {}".format(user_1.shape))
print("user_2 shape: {}".format(user_2.shape))

user_1 dimensions: (10, 5)
user_2 dimensions: (10, 3)

In [ ]:
# Azonositó benn foglalás ellenőrzése
user_1['ugyfel_id'].isin(user_2['ugyfel_id']).value_counts()

True     8
False    2
Name: ugyfel_id, dtype: int64

---

## Két forrás tartalmának összekapcsolása 2.

Kapcsolás az `ugyfel_id` kulcs mező szerint történik, de itt korréten megadjuk a kapcsolódo mezők nevét.

---

In [ ]:
result = pd.merge(user_1,
                 user_2[['igazolvanytipus_id', 'ugyfel_id']], ## hozzáfűzési mezők // nem szerepel az első a kulcs mező
                 left_on='ugyfel_id', right_on='ugyfel_id',   ## kulcs mezők konkrét megadása a kapcsoláshoz (eltérő nevüek)
                 how='outer',                                 ## Kapcsolat módja left
                 indicator=True                               ## jelző újmezőben megjelenítése                   
                 )
result.head(12)                                               ## első 12 sor megjelenítése (most összesen ennyi van)

,ugyfel_id,vnev,knev,szdatum,nem,igazolvanytipus_id,_merge
0,1,Walter,Gwendolyn,1954-07-10,M,NaN,left_only
1,2,Armstrong,Kieran,1932-02-24,M,NaN,left_only
2,3,Kline,Silas,1938-07-16,M,J,both
3,4,Gallagher,Rhoda,1972-10-28,M,J,both
4,5,Gallagher,Robin,1940-02-02,M,SZ,both
5,6,Frank,Blair,1977-12-19,M,UL,both
6,7,Cash,Vaughan,1989-04-06,M,UL,both
7,8,Shields,Charissa,1926-03-25,F,J,both
8,9,Brown,Inga,1942-04-18,F,SZ,both
9,10,Crawford,Glenna,1969-05-14,F,UL,both
10,11,NaN,NaN,NaN,NaN,SZ,right_only
11,12,NaN,NaN,NaN,NaN,SZ,right_only

---
## Adatszámlálások


---

In [ ]:
print("Összesen van {} sorunk, amelyben nem szerepel egy oszlopban sem nulla.".format(
    (result.apply(lambda x: x.isnull().sum(), axis=1) == 0).sum()))
print("Hiányzó adat {} szor fordul elő az 'igazolvanytipus_id' mezőben.".format(
        result['igazolvanytipus_id'].isnull().sum()))

Összesen van 8 sorunk, amelyben nem szerepel egy oszlopban sem nulla.
Hiányzó adat 2 szor fordul elő az 'igazolvanytipus_id' mezőben.

---

## A szűrések

---

In [ ]:
user_1[user_1.nem == 'F'] ## Nők megjelenitése csak azok amelyek a nem mezőben F -et tartalmaznak

   ugyfel_id      vnev      knev     szdatum nem
7          8   Shields  Charissa  1926-03-25   F
8          9     Brown      Inga  1942-04-18   F
9         10  Crawford    Glenna  1969-05-14   F

In [ ]:
user_1[user_1.vnev.str.startswith('Ga')]  ## Ga vnev kezdettel rendelkezők listázása

   ugyfel_id       vnev   knev     szdatum nem
3          4  Gallagher  Rhoda  1972-10-28   M
4          5  Gallagher  Robin  1940-02-02   M

---

## Statisztikai függvények használata

---

In [ ]:
## Hányan vannak a nők és a férfiak és milyen idősek a legfiatalabbak
user_1.groupby("nem").agg({
        "szdatum": "min",  ## mean, max, ..
        "knev": "count"
    })

        szdatum  knev
nem
F    1926-03-25     3
M    1932-02-24     7

---

## SQL és Pandas szintaktika összevetése




---

In [ ]:
import time
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import sqlite3
import numpy as np


##------------------------------- SQL alapok (SqLite)

sqlite_alapok = r"""
conn = sqlite3.connect(r"c:\Users\u23442\kl\sqlite\minta.db")

## Tábla létrehozás, ha még nem létezik
conn.execute("create table if not exists  user (name text, age integer)")

 

## Beírás kurzoron keresztül
c = conn.cursor()
c.execute("INSERT INTO user VALUES ('User A', 42)")
c.execute("INSERT INTO user VALUES ('User B', 43)")
 

## Csoportos beírás
L = [('abcd_dfj', 300),
     ('cfgd_dyfj', 400),
     ('sdd_dfjh', 305)]

conn.executemany("insert into user values (?, ?)", L)
 

## Véglegesítés
conn.commit()

 

c.execute("SELECT * FROM user")
print('KIIRAS : ',c.fetchall()) ## KIIRAS :  [('User A', 42), ('User B', 43)..

 

rows = c.execute("select * from user")
for row in rows:
    print('Nevek : ',row[0]),  ## Nevek :  cfgd_dyfj

 
for row in conn.execute("select * from user"):
    print('SOR : ',row)       ## SOR :  ('User A', 42)
    
## Kapcsolat bezárása
conn.close()

 

# ----------------------  Pandas


## pandas állományba írás
d = {'a': (1, 2, 101), 'b': (2, 2, 202), 'c': (3, 3, 303.123456789),'e': (3,2, 203),'f': (3, 3,103),'g': (2, 1,303)}
df=pd.DataFrame.from_dict(d, orient="index")
df.to_csv("data.csv")
 

## pandas állományból olvasás
df = pd.read_csv("data.csv")
d = df.to_dict()
print('Eredeti : ', df)
 

## mező átnevezés       / sql: select mezo as ujmezo
df.columns = ['col2',  'col3', 'col4']
print('Átnevezett : ', df)
 

## egyediek kiválasztása / sql: select distinct
np.unique(df['col2'])
print('Egyedi : ', np.unique(df['col2']))
 

## dátumtra alakítás   / sql: select CAST(col1 AS DATE) AS col2
print('Datumra alakítva : ', pd.to_datetime(df['col4']))
 

## tipzedes pontosság változtatása / select CAST(col1 AS DECIMAL(15,4))
df['col4'] = df['col4'].round(4)
print('Átnevezett : ', df)
 

## szűrés rekordsorszám és mező sorszám alapján
szurt = df.iloc[0:3, 0:1]  ## első három sor kiválasztása és csak a col2 oszlop
szurt.to_csv('my.output.csv', index = 0)  ## fejlécsor kihagyása kiíráskor
print('Szűrt : ', szurt)
 

## első pár sor  / sql:SELECT TOP 10
print('Csak az első három sor : ', df.head(3))


## csoportosított összeadás / sql: SELECT col1, col2 ,COUNT(*), agv(mezo)
print('összegzés : ',df.groupby(['col2']).agg({'col4':[np.size, np.mean]}))


## /sql: ROW_NUMBER() OVER (PARTITION BY col2, col3 ORDER BY col4 ASC) AS rn
df2 = df.assign(rn=df.sort_values(['col4'], ascending=True).groupby(['col2','col3']).cumcount() + 1)
print('Kiválasztási lista : ', df2)

 

## / sql: SELECT * FROM (SELECT t.*, ROW_NUMBER() OVER(PARTITION BY day ORDER BY total_bill DESC) AS rn WHERE rn < 3 ORDER BY day, rn;
df2 = df.assign(rn=df.sort_values(['col4'], ascending=False).groupby(['col3']).cumcount() + 1).query('rn < 3').sort_values(['col2','rn'])
print('Kiválasztási lista2 : ', df2)


## ---------------  sűrések
 
/sql: UNION ALL            
pd.concat([df1, df2])


/sql: UNION       
pd.concat([df1, df2]).drop_duplicates()

"""

 

#st = ['foo', 'foobar', 'baz', 'qux','python', 'Guido Van Rossum'] * 10000

# print('st0 : ',st)          

 

kl_segito="""
## Minta keresés tartalmazás
%time st1 = [x for x in st if x.startswith('foo')]
%time st2 = [x for x in st if x[:3] == 'foo']
%timeit [x for x in st if x.startswith('foo')]
%timeit [x for x in st if x[:3] == 'foo']
#print('st1 : ',st1) 
#print('st2 : ',st2) 
#----

 

import some_lib
reload(some_lib)  ## megváltozott modul újra olvasása, friseb verzió betöltés kierőszakolása

 
 

class Message:
    def __init__(self, msg):
        self.msg = msg
    def __repr__(self):
        return 'Visszamondom neked : %s' % self.msg

x = Message('Mond vissza, kérlek.')
print(x)

 

## ------------------ numpy

data = ([[ 0.9526, -0.246 , -0.8856],[ 0.5639, 0.2379, 0.9104]])
data2= np.array(data)
print(data2.shape)

 

kl=np.empty((2, 3, 2))
print(kl)

 

kl = np.array([[1., 2., 3.], [4., 5., 6.]])
kl = kl*kl
print(kl)
"""

In [ ]:
import numpy as np
import pandas as pd

url = (r'https://raw.github.com/pandas-dev/pandas/master/pandas/tests/io/data/csv/tips.csv')
tips = pd.read_csv(url)
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [ ]:
## SELECT total_bill, tip, smoker, time FROM tips LIMIT 5;  # /sql =>
print(tips[['total_bill', 'tip', 'smoker', 'time']].head(5))

   total_bill   tip smoker    time
0       16.99  1.01     No  Dinner
1       10.34  1.66     No  Dinner
2       21.01  3.50     No  Dinner
3       23.68  3.31     No  Dinner
4       24.59  3.61     No  Dinner

In [ ]:
## SELECT *, tip/total_bill as szamolt FROM tips LIMIT 5;  # új számolt mezővel bővítés /sql =>
print(tips.assign(szamolt=tips['tip'] / tips['total_bill']).head(5))

   total_bill   tip     sex smoker  day    time  size   szamolt
0       16.99  1.01  Female     No  Sun  Dinner     2  0.059447
1       10.34  1.66    Male     No  Sun  Dinner     3  0.160542
2       21.01  3.50    Male     No  Sun  Dinner     3  0.166587
3       23.68  3.31    Male     No  Sun  Dinner     2  0.139780
4       24.59  3.61  Female     No  Sun  Dinner     4  0.146808

In [ ]:
## SELECT * FROM tips WHERE size = 4  LIMIT 5;  # Szűrés /sql =>
print(tips[tips['size'] == 4].head(5))

    total_bill   tip     sex smoker  day    time  size
4        24.59  3.61  Female     No  Sun  Dinner     4
5        25.29  4.71    Male     No  Sun  Dinner     4
7        26.88  3.12    Male     No  Sun  Dinner     4
11       35.26  5.00  Female     No  Sun  Dinner     4
13       18.43  3.00    Male     No  Sun  Dinner     4

In [ ]:
is_dinner = tips['time'] == 'Dinner'
print(is_dinner.value_counts())

True     176
False     68
Name: time, dtype: int64

In [ ]:
tips[is_dinner].head(5)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [ ]:
## SELECT * FROM tips WHERE time = 'Dinner' AND tip > 5.00; # Összetett szűrés és-es & /sql =>
print(tips[(tips['time'] == 'Dinner') & (tips['tip'] > 5.00)])

     total_bill    tip     sex smoker  day    time  size
23        39.42   7.58    Male     No  Sat  Dinner     4
44        30.40   5.60    Male     No  Sun  Dinner     4
47        32.40   6.00    Male     No  Sun  Dinner     4
52        34.81   5.20  Female     No  Sun  Dinner     4
59        48.27   6.73    Male     No  Sat  Dinner     4
116       29.93   5.07    Male     No  Sun  Dinner     4
155       29.85   5.14  Female     No  Sun  Dinner     5
170       50.81  10.00    Male    Yes  Sat  Dinner     3
172        7.25   5.15    Male    Yes  Sun  Dinner     2
181       23.33   5.65    Male    Yes  Sun  Dinner     2
183       23.17   6.50    Male    Yes  Sun  Dinner     4
211       25.89   5.16    Male    Yes  Sat  Dinner     4
212       48.33   9.00    Male     No  Sat  Dinner     4
214       28.17   6.50  Female    Yes  Sat  Dinner     3
239       29.03   5.92    Male     No  Sat  Dinner     3

In [ ]:
## SELECT * FROM tips WHERE size >= 5 OR total_bill > 45;  # Összetett szűrés vagy-os | /sql =>
print(tips[(tips['size'] >= 5) | (tips['total_bill'] > 45)])

     total_bill    tip     sex smoker   day    time  size
59        48.27   6.73    Male     No   Sat  Dinner     4
125       29.80   4.20  Female     No  Thur   Lunch     6
141       34.30   6.70    Male     No  Thur   Lunch     6
142       41.19   5.00    Male     No  Thur   Lunch     5
143       27.05   5.00  Female     No  Thur   Lunch     6
155       29.85   5.14  Female     No   Sun  Dinner     5
156       48.17   5.00    Male     No   Sun  Dinner     6
170       50.81  10.00    Male    Yes   Sat  Dinner     3
182       45.35   3.50    Male    Yes   Sun  Dinner     3
185       20.69   5.00    Male     No   Sun  Dinner     5
187       30.46   2.00    Male    Yes   Sun  Dinner     5
212       48.33   9.00    Male     No   Sat  Dinner     4
216       28.15   3.00    Male    Yes   Sat  Dinner     5

In [ ]:
frame = pd.DataFrame({'col1': ['A', 'B', np.NaN, 'C', 'D'],
                      'col2': ['F', np.NaN, 'G', 'H', 'I']})

## SELECT * FROM frame WHERE col2 IS NULL;  /sql =>
print(frame[frame['col2'].isna()])

  col1 col2
1    B  NaN

In [ ]:
## SELECT * FROM frame WHERE col1 IS NOT NULL;    /sql =>
print(frame[frame['col2'].notna()])

  col1 col2
0    A    F
2  NaN    G
3    C    H
4    D    I

In [ ]:
## SELECT sex, count(*) FROM tips GROUP BY sex;  /sql =>
print('Size     : ', tips.groupby('sex').size())
print('Count    : ', tips.groupby('sex')['total_bill'].count())
print('CountAll : ', tips.groupby('sex').count())

Size     :  sex
Female     87
Male      157
dtype: int64
Count    :  sex
Female     87
Male      157
Name: total_bill, dtype: int64
CountAll :          total_bill  tip  smoker  day  time  size
sex
Female          87   87      87   87    87    87
Male           157  157     157  157   157   157

In [ ]:
## SELECT day, AVG(tip), COUNT(*) FROM tips GROUP BY day; /sql =>
print(tips.groupby('day').agg({'tip': np.mean, 'day': np.size}))

           tip  day
day
Fri   2.734737   19
Sat   2.993103   87
Sun   3.255132   76
Thur  2.771452   62

In [ ]:
## SELECT smoker, day, COUNT(*), AVG(tip) FROM tips GROUP BY smoker, day;   /sql =>
print(tips.groupby(['smoker', 'day']).agg({'tip': [np.size, np.mean]}))

              tip
             size      mean
smoker day
No     Fri    4.0  2.812500
       Sat   45.0  3.102889
       Sun   57.0  3.167895
       Thur  45.0  2.673778
Yes    Fri   15.0  2.714000
       Sat   42.0  2.875476
       Sun   19.0  3.516842
       Thur  17.0  3.030000

In [ ]:
## JOIN
df1 = pd.DataFrame({'key': ['A', 'B', 'C', 'D'],
                    'value': np.random.randn(4)})
df2 = pd.DataFrame({'key': ['B', 'D', 'D', 'E'],
                    'value': np.random.randn(4)})

## SELECT * FROM df1 INNER JOIN df2   ON df1.key = df2.key;  /sql =>
print(pd.merge(df1, df2, on='key'))

  key   value_x   value_y
0   B -1.551345  1.328343
1   D -2.079102  1.324529
2   D -2.079102 -1.423345

In [ ]:
indexed_df2 = df2.set_index('key')
print(pd.merge(df1, indexed_df2, left_on='key', right_index=True))

  key   value_x   value_y
1   B -1.551345  1.328343
3   D -2.079102  1.324529
3   D -2.079102 -1.423345

In [ ]:
## SELECT * FROM df1 LEFT OUTER JOIN df2   ON df1.key = df2.key;  /sql =>
print(pd.merge(df1, df2, on='key', how='left'))

  key   value_x   value_y
0   A  1.642389       NaN
1   B -1.551345  1.328343
2   C  0.665297       NaN
3   D -2.079102  1.324529
4   D -2.079102 -1.423345

In [ ]:
## SELECT * FROM df1 RIGHT OUTER JOIN df2   ON df1.key = df2.key;   /sql =>
print(pd.merge(df1, df2, on='key', how='right'))

  key   value_x   value_y
0   B -1.551345  1.328343
1   D -2.079102  1.324529
2   D -2.079102 -1.423345
3   E       NaN  0.280305

In [ ]:
## SELECT * FROM df1 FULL OUTER JOIN df2   ON df1.key = df2.key; /sql =>
print(pd.merge(df1, df2, on='key', how='outer'))

  key   value_x   value_y
0   A  1.642389       NaN
1   B -1.551345  1.328343
2   C  0.665297       NaN
3   D -2.079102  1.324529
4   D -2.079102 -1.423345
5   E       NaN  0.280305

In [ ]:
df1 = pd.DataFrame({'city': ['Chicago', 'San Francisco', 'New York City'],
                    'rank': range(1, 4)})
df2 = pd.DataFrame({'city': ['Chicago', 'Boston', 'Los Angeles'],
                    'rank': [1, 4, 5]})

## union all
print(pd.concat([df1, df2]))

            city  rank
0        Chicago     1
1  San Francisco     2
2  New York City     3
0        Chicago     1
1         Boston     4
2    Los Angeles     5

In [ ]:
## union
print(pd.concat([df1, df2]).drop_duplicates())

            city  rank
0        Chicago     1
1  San Francisco     2
2  New York City     3
1         Boston     4
2    Los Angeles     5